InformationRegisters/ПринятиеЛицензионногоСоглашения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПринятиеЛицензионногоСоглашения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Принято</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПринятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ЛицензионноеСоглашение/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьМакетHTML();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМакетHTML()

	ТекстСоглашения = ПолучитьОбщийМакет("ЛицензионноеСоглашение").ПолучитьТекст();

Конецпроцедуры

&НаКлиенте
Процедура НеПринимаю(Команда)
	НеПринимаюНаСервере();
	ПрекратитьРаботуСистемы();
КонецПроцедуры

&НаКлиенте
Процедура Принимаю(Команда)
	
	РазрешеноЗакрытие = Истина; // №13385
	
	ПринимаюНаСервере();
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПринимаюНаСервере()
	//Константы.ЛицензионноеСоглашениеПринято.Установить(Истина);
	
	// Заявка №4877
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = РегистрыСведений.ПринятиеЛицензионногоСоглашения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Принято = Истина;
	МенеджерЗаписи.ДатаПринятия = ТекущаяДатаСеанса();
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура НеПринимаюНаСервере()
	//Константы.ЛицензионноеСоглашениеПринято.Установить(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//++ №13385
	Если НЕ РазрешеноЗакрытие Тогда
		Отказ = Истина;
	КонецЕсли;
	//-- №13385
	
КонецПроцедуры
